---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.GetPolyloop
source: html/7999c819-811e-3382-0f41-b2c4b2748ed4.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.GetPolyloop Method

Gets the planar polygon describing the surface geometry.

## Syntax (C#)
```csharp
public Polyloop GetPolyloop()
```

## Returns
The planar polygon describing the surface geometry.

## Remarks
A planar polygon describing the surface geometry as described
 in gbXML. The geometry is currently measured per analytical(center-line).